---
kind: other
id: Methods.T:Autodesk.Revit.DB.WireframeBuilder
source: html/51781a8d-4b31-77e4-d0a1-3306076ab413.htm
---
# WireframeBuilder Methods

Add a curve to the shape representation stored in this WireframeBuilder.